<html><head><meta content="text/html; charset=UTF-8" http-equiv="content-type"><style type="text/css">ol{margin:0;padding:0}table td,table th{padding:0}.c1{color:#000000;font-weight:700;text-decoration:none;vertical-align:baseline;font-size:12pt;font-family:"Arial";font-style:normal}.c2{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:12pt;font-family:"Arial";font-style:normal}.c0{padding-top:12pt;padding-bottom:12pt;line-height:1.5;orphans:2;widows:2;text-align:justify}.c4{background-color:#ffffff;max-width:451.4pt;padding:72pt 72pt 72pt 72pt}.c3{font-size:12pt;font-weight:700}.c5{height:11pt}.title{padding-top:0pt;color:#000000;font-size:26pt;padding-bottom:3pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}.subtitle{padding-top:0pt;color:#666666;font-size:15pt;padding-bottom:16pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}li{color:#000000;font-size:11pt;font-family:"Arial"}p{margin:0;color:#000000;font-size:11pt;font-family:"Arial"}h1{padding-top:20pt;color:#000000;font-size:20pt;padding-bottom:6pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h2{padding-top:18pt;color:#000000;font-size:16pt;padding-bottom:6pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h3{padding-top:16pt;color:#434343;font-size:14pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h4{padding-top:14pt;color:#666666;font-size:12pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h5{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h6{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;font-style:italic;orphans:2;widows:2;text-align:left}</style></head><body class="c4"><p class="c0"><span class="c1">PROTOCOLOS:</span></p><p class="c0"><span class="c1">&iquest;C&oacute;mo funciona el internet?</span></p><p class="c0"><span class="c2">Para que el remitente pueda enviar un paquete de datos al destinatario, el protocolo IP define una estructura de paquetes que agrupa los datos que se tienen que enviar. En la cabecera de dicho paquete ir&aacute; la informaci&oacute;n sobre el origen y el destino de los datos. </span></p><p class="c0"><span class="c1">Protocolo de internet IP.</span></p><p class="c0"><span class="c2">La funci&oacute;n principal es conseguir que los datos lleguen desde origen al destino, aunque no tenga una conexi&oacute;n directa. Estos datos se transfieren mediante paquetes conmutados &mdash;m&eacute;todo de agrupar los datos transmitidos a trav&eacute;s de una red digital en paquetes, estos est&aacute;n compuestos por los datos en s&iacute; y la informaci&oacute;n de control que nos indicar&aacute; cual es la ruta que debe tomar para que los datos lleguen a destino&mdash;.</span></p><p class="c0"><span class="c1">Protocolo de control de Transmisi&oacute;n TCP.</span></p><p class="c0"><span class="c2">El TCP &mdash;Transmission Control Protocol, en ingl&eacute;s&mdash; garantiza que los datos sean entregados al lugar de destino, sin ning&uacute;n error y en el mismo orden que se transmitieron. Se encuentra en una capa intermedia entre el protocolo IP y la aplicaci&oacute;n y, esta ubicaci&oacute;n se debe a que la aplicaci&oacute;n necesita que la comunicaci&oacute;n de la red sea confiable. </span></p><p class="c0"><span class="c1">Protocolo DNS.</span></p><p class="c0"><span class="c2">El sistema de nombres de dominio &mdash;DNS, en ingl&eacute;s Domain Name System&mdash;, es un sistema de nomenclatura jer&aacute;rquico descentralizado para dispositivos conectados tanto a Internet como a redes privadas, que asocia informaci&oacute;n con el nombre del dominio.</span></p><p class="c0"><span class="c3">Protocolo TCP/IP.</span></p><p class="c0"><span class="c2">Es usado para comunicaciones en redes y, como todo protocolo, describe un conjunto de gu&iacute;as generales de operaci&oacute;n para permitir que un equipo pueda comunicarse en una red. TCP/IP provee conectividad de extremo a extremo especificando c&oacute;mo los datos deber&iacute;an ser formateados, direccionados, transmitidos, enrutados y recibidos por el destinatario.</span></p><p class="c0"><span class="c1">Protocolo UDP.</span></p><p class="c0"><span class="c2">Su funci&oacute;n es permitir el env&iacute;o de datagramas a trav&eacute;s de la red sin que se haya establecido previamente una conexi&oacute;n ya que el propio datagrama incorpora suficiente informaci&oacute;n de direccionamiento en su cabecera.</span></p><p class="c0"><span class="c2">El protocolo UDP es m&aacute;s ligero ya que no utiliza tantas capas como el protocolo TCP/IP porque no existe un control sobre el env&iacute;o de los paquetes.</span></p><p class="c0"><span class="c1">Protocolo HTTP.</span></p><p class="c0"><span class="c2">El protocolo de transferencia de hipertexto &mdash;HTTP, en ingl&eacute;s Hypertext Transfer Protocol&mdash; es un protocolo orientado a transacciones y sigue el esquema petici&oacute;n-respuesta entre un cliente y un servidor. El cliente &mdash;normalmente un navegador web&mdash; realiza una petici&oacute;n enviando un mensaje, con cierto formato al servidor. El servidor &mdash;o servidor web&mdash; le env&iacute;a un mensaje de respuesta, permitiendo la comunicaci&oacute;n entre ambos. No est&aacute; protegida y podr&iacute;amos pensar que toda la informaci&oacute;n est&aacute; en texto puro. Si alguien intercepta una comunicaci&oacute;n, podr&iacute;a ver nuestros datos.</span></p><p class="c0"><span class="c1">Protocolo HTTPS.</span></p><p class="c0"><span class="c2">El protocolo seguro de transferencia de hipertexto &mdash;en ingl&eacute;s, Hypertext Transfer Protocol Secure o HTTPS&mdash; est&aacute; destinado a la transferencia segura de datos de hipertexto. Lo que hace es encriptar los datos que son enviados entre clientes y servidores utilizando algoritmos, de este modo toda la informaci&oacute;n sensible, como n&uacute;meros de tarjetas, pueden ser enviados de manera segura. Si alguien intercepta una comunicaci&oacute;n obtendr&iacute;a un mensaje encriptado y este va a ser muy dif&iacute;cil de desencriptar.</span></p><p class="c0"><span class="c3">Direcci&oacute;n IP.</span></p><p class="c0"><span class="c2">Una direcci&oacute;n IP es una cadena de n&uacute;meros separados por puntos. Cada conjunto de n&uacute;meros se denomina octeto.</span></p><p class="c0"><span class="c2">Cada octeto puede contener n&uacute;meros que van del 0 al 255. Cada octeto est&aacute; formado por 8 bits, 255 es el n&uacute;mero m&aacute;s grande que puede ser formado por un n&uacute;mero de 8 bits. Cada direcci&oacute;n est&aacute; compuesta por un n&uacute;mero de red y un n&uacute;mero de host. La porci&oacute;n del n&uacute;mero que identifica a la red var&iacute;a en base a las clases.</span></p><p class="c0 c5"><span class="c2"></span></p></body></html>