<html><head><meta content="text/html; charset=UTF-8" http-equiv="content-type"><style type="text/css">ol{margin:0;padding:0}table td,table th{padding:0}.c0{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:11pt;font-family:"Arial";font-style:normal}.c1{color:#000000;font-weight:700;text-decoration:none;vertical-align:baseline;font-size:11pt;font-family:"Arial";font-style:normal}.c2{padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:justify}.c5{background-color:#ffffff;max-width:451.4pt;padding:72pt 72pt 72pt 72pt}.c4{font-weight:700}.c3{height:11pt}.title{padding-top:0pt;color:#000000;font-size:26pt;padding-bottom:3pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}.subtitle{padding-top:0pt;color:#666666;font-size:15pt;padding-bottom:16pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}li{color:#000000;font-size:11pt;font-family:"Arial"}p{margin:0;color:#000000;font-size:11pt;font-family:"Arial"}h1{padding-top:20pt;color:#000000;font-size:20pt;padding-bottom:6pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h2{padding-top:18pt;color:#000000;font-size:16pt;padding-bottom:6pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h3{padding-top:16pt;color:#434343;font-size:14pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h4{padding-top:14pt;color:#666666;font-size:12pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h5{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h6{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;font-style:italic;orphans:2;widows:2;text-align:left}</style></head><body class="c5"><p class="c2"><span class="c1">Seguridad inform&aacute;tica</span></p><p class="c2 c3"><span class="c1"></span></p><p class="c2"><span>La</span><span class="c0">&nbsp;seguridad se ha ido transformando, gracias a los controles y auditor&iacute;as sobre los sistemas, explotando las vulnerabilidades que se puedan encontrar en los mismos. Se han implementado medidas de seguridad f&iacute;sica y l&oacute;gicas en conjunto con la seguridad en Internet.</span></p><p class="c2 c3"><span class="c0"></span></p><p class="c2"><span class="c0">Por otro lado, ser&iacute;a fant&aacute;stico poder analizar de forma particular cu&aacute;l es el impacto que ha causado en la sociedad, en sus normas jur&iacute;dicas y &eacute;ticas. Adem&aacute;s, reconocer e identificar los delitos inform&aacute;ticos y las consecuencias legales que implican el no acatarlas.</span></p><p class="c2 c3"><span class="c0"></span></p><p class="c2"><span class="c1">Ciberseguridad.</span></p><p class="c2 c3"><span class="c0"></span></p><p class="c2"><span class="c0">Debemos tener en cuenta que la seguridad inform&aacute;tica &uacute;nicamente se va a centrar en el medio de comunicaci&oacute;n por el cual va a viajar la informaci&oacute;n. No debemos confundir este t&eacute;rmino con el de seguridad de la informaci&oacute;n, ya que esta &uacute;ltima puede estar en diferentes medios y no solo en los medios inform&aacute;ticos.</span></p><p class="c2 c3"><span class="c0"></span></p><p class="c2"><span class="c1">Tipos de amenazas:</span></p><p class="c2 c3"><span class="c1"></span></p><p class="c2"><span class="c0">Malware: Software maligno que tiene como objetivo infiltrarse o da&ntilde;ar un sistema de informaci&oacute;n sin el consentimiento del usuario. Necesita estar oculto para que el usuario no lo elimine. Existen distintos tipos de malware:</span></p><p class="c2 c3"><span class="c0"></span></p><p class="c2"><span class="c1">Virus:</span></p><p class="c2 c3"><span class="c1"></span></p><p class="c2"><span class="c0">M&aacute;s antiguo, antes que la red. Busca permanecer en el sistema copiandose a s&iacute; mismo en varios lugares desde el momento en que se ejecuta en el sistema, as&iacute; cuando se elimine un archivo el virus seguir&aacute; existiendo en otras partes del sistema. Su objetivo var&iacute;a pero generalmente buscan destruir o inhabilitar archivos o programas y afectar el funcionamiento del dispositivo. Se adhieren a los ejecutables o al registro maestro de arranque. Son de poca infecci&oacute;n, no tienen la capacidad por s&iacute; mismos de afectar otros dispositivos a menos que se pasen por hardware (pendrive).</span></p><p class="c2 c3"><span class="c0"></span></p><p class="c2"><span class="c1">Gusano:</span></p><p class="c2 c3"><span class="c1"></span></p><p class="c2"><span class="c0">Se copia a s&iacute; mismo en sistema y utiliza la red para copiarse a otras m&aacute;quinas a trav&eacute;s de vulnerabilidades o agujeros en la seguridad. Por lo que posee mayor capacidad de infecci&oacute;n. Su objetivo es saturar el funcionamiento del sistema. </span></p><p class="c2 c3"><span class="c0"></span></p><p class="c2"><span class="c1">Troyanos:</span></p><p class="c2 c3"><span class="c1"></span></p><p class="c2"><span class="c0">No causa da&ntilde;o por s&iacute; mismo. Estructura usada para cargar malwares ocultos. Usualmente programas sin licencia y cracks. Requiere de la ejecuci&oacute;n del usuario porque no puede multiplicarse solo. </span></p><p class="c2 c3"><span class="c0"></span></p><p class="c2"><span class="c1">Adwares:</span></p><p class="c2 c3"><span class="c1"></span></p><p class="c2"><span class="c0">Buscan bombardear el dispositivo con publicidad. No son da&ntilde;inos y usualmente vienen dentro de troyanos.</span></p><p class="c2 c3"><span class="c0"></span></p><p class="c2"><span class="c1">Spywares:</span></p><p class="c2 c3"><span class="c1"></span></p><p class="c2"><span class="c0">No da&ntilde;a el dispositivo pero roba toda la informaci&oacute;n del sistema. Permanece oculto y roba datos, o accede a la c&aacute;mara o micr&oacute;fono del dispositivo sin que el usuario lo note. Ingresan en troyanos o son instalados, como keyloguer que registra las pulsaciones del teclado para almacenar la informaci&oacute;n a partir de lo que el usuario escribe.</span></p><p class="c2 c3"><span class="c0"></span></p><p class="c2"><span class="c1">Rootkits:</span></p><p class="c2 c3"><span class="c0"></span></p><p class="c2"><span class="c0">Conjunto de software. Van dirigidos al firmware del sistema o a los programas de usuario y consiguen acceso al dispositivo en modo sistema, o kernel. Modifican operaciones del SO, archivos de sistema y cuentas de usuarios. Pueden esconderse de los antivirus.</span></p><p class="c2 c3"><span class="c0"></span></p><p class="c2"><span class="c1">Botnet:</span></p><p class="c2 c3"><span class="c1"></span></p><p class="c2"><span class="c0">Red de robots puestos por un atacante en una red para controlar todos los dispositivos al mismo tiempo. Se usa con el objetivo de cometer cr&iacute;menes digitales o crimeware. Tambi&eacute;n utilizan troyanos. </span></p><p class="c2 c3"><span class="c0"></span></p><p class="c2"><span class="c1">Ransomware:</span></p><p class="c2 c3"><span class="c0"></span></p><p class="c2"><span class="c0">Se caracterizan por no permanecer ocultos al usuario. Se utilizan para secuestrar la informaci&oacute;n de una empresa para luego pedir dinero como rescate.</span></p><p class="c2 c3"><span class="c0"></span></p><p class="c2"><span class="c1">Protecci&oacute;n de la informaci&oacute;n.</span></p><p class="c2 c3"><span class="c0"></span></p><p class="c2"><span class="c0">Consiste en que la informaci&oacute;n se encuentre completa y que los datos que est&aacute;n dentro del sistema sean los que deber&iacute;an ser. Un ejemplo de esta dimensi&oacute;n ser&iacute;a el ataque a una base de datos y la modificaci&oacute;n de los datos que hay en la misma, con lo cual podemos seguir viendo la informaci&oacute;n, pero la misma es err&oacute;nea debido a que la original fue alterada. &nbsp;</span></p><p class="c2 c3"><span class="c0"></span></p><p class="c2"><span class="c1">Disponibilidad:</span></p><p class="c2 c3"><span class="c0"></span></p><p class="c2"><span class="c0">Significa que la informaci&oacute;n una persona/usuario debe poder tener acceso a la informaci&oacute;n en el momento que lo necesita, es decir, en tiempo y forma. Un t&iacute;pico ataque a este tipo de dimensi&oacute;n es el ataque de denegaci&oacute;n de servicio.</span></p><p class="c2 c3"><span class="c0"></span></p><p class="c2"><span class="c4">Redundancia</span><span class="c0">:</span></p><p class="c2 c3"><span class="c0"></span></p><p class="c2"><span class="c0">De esta forma la informaci&oacute;n y las validaciones de acceso se repitan tanto que la informaci&oacute;n est&aacute; segura de no perderse en su totalidad (preventiva).</span></p><p class="c2"><span class="c1">Parches de seguridad</span></p><p class="c2"><span class="c0">Cuando se detecta una falla, debe solucionarse el problema para que no vuelva a ocurrir, igualmente si la falla fue por un software, actualizarlo con la vulnerabilidad resuelta.</span></p><p class="c2 c3"><span class="c0"></span></p><p class="c2"><span class="c1">Confidencialidad.</span></p><p class="c2"><span class="c0">Refiere a que la informaci&oacute;n tiene que estar disponible &uacute;nicamente para las personas que tienen acceso a esta informaci&oacute;n y bloqueada para el acceso a terceros. Por ejemplo, los datos personales e historiales m&eacute;dicos. </span></p><p class="c2 c3"><span class="c0"></span></p><p class="c2"><span class="c1">Fallas:</span></p><p class="c2 c3"><span class="c0"></span></p><p class="c2"><span class="c0">Una falla, tambi&eacute;n conocida como bug, es un error en un programa o sistema operativo que desencadena un resultado indeseado. </span></p><p class="c2"><span class="c0">El t&eacute;rmino bug viene desde 1947 cuando Grace Hopper, mientras estaba programando el Mark II, descubri&oacute; que un insecto (bug) hab&iacute;a provocado un error en uno de sus rel&eacute;s electromagn&eacute;ticos. </span></p><p class="c2"><span class="c0">En el desarrollo del software existen muchos tipos de fallas, pero en general se pudieron establecer unos tipos generales de bugs seg&uacute;n su comportamiento.</span></p><p class="c2 c3"><span class="c0"></span></p><p class="c2"><span class="c0">Heisenbug</span></p><p class="c2"><span class="c0">Bohrbug</span></p><p class="c2"><span class="c0">Mandelbug</span></p><p class="c2"><span class="c0">Schroedinbugs</span></p></body></html>